import { useNavigate } from "react-router-dom";
import ServiceBox from "./ServiceBox";

const services = [
  {
    title:
      "Тепловизионное обследование по определению утечек тепла, промерзания",
    image: "services/heat.png",
    description:
      "Мы рады предложить вам нашу услугу по проведению тепловизионного обследования с целью выявления утечек тепла в вашем доме или офисе. Зачастую, утечки тепла могут стать причиной излишних затрат на оплатуотопления и повышения расходов на энергию, а также привести к образованию плесени, а также намоканию стен. Процедура тепловизионного обследования позволяет определить и обозначить точные места, где происходят утечки тепла. Мы используем современное поверенное оборудование, которое позволяет выявлять даже незначительные утечки тепла из строительных конструкций помещения, что помогает диагностировать и устранять возможные проблемы в дальнейшем. После проведения тепловизионной экспертизы наши специалисты составят подробный отчет и дадут рекомендации по ремонту и устранению дефектов, которые могут образоваться в будущем. Уберегая Вас от дополнительных затрат на стоимость счетов за отопление и электроэнергию. Не откладывайте звонок, обратитесь к нам, чтобы получить в кротчайшие сроки профессиональную тепловизионную экспертизу вашего помещения.",
  },
  {
    title:
      "Строительно-техническая экспертиза для определения причин залития помещений",
    image: "services/zaliv.svg",
    description:
      "Мы готовы представить вам услугу по проведению строительно-технической экспертизы для определения причин залития помещений. Залитие помещений может привести к серьезным повреждениям отделки, ухудшению качества воздуха вследствие образования плесени и сырости в помещениях, а также значительные финансовые затраты на восстановление отделки помещений. Определить источник проблемы необходимо в кратчайшие сроки, чтобы минимизировать ущерб и принять необходимые меры для скорейшего восстановления помещений. Наша команда опытных специалистов использует современные методики и технологии для диагностики причин залития. Мы проводим тщательный анализ строительных конструкций, систем водоснабжения и канализации, систем вентиляции и кондиционирования. В результате применения профессионального оборудования и методов исследования мы можем точно определить, откуда поступает вода, и предложить пути решения проблемы. По завершении экспертизы мы подготовим детализированный отчет с выводами и рекомендациями по устранению причин залития помещений. Это поможет вам не только восстановить нормальное состояние отделки помещений, но и предотвратить повторные случаи в будущем. Не рискуйте своим имуществом – обращайтесь к нам для профессиональной строительно-технической экспертизы. Мы готовы помочь вам найти ответы на ваши вопросы и обеспечить безопасность вашего дома или офиса.",
  },
  {
    title: "Определение качества выполненных строительно монтажных работ",
    image: "services/quality.png",
    description:
      "Предлагаем вам услугу по определению качества строительно-монтажных работ. Это важный шаг для обеспечения дальнейшего комфортного проживания в вашем жилом объекте. Определение качества строительно-монтажных работ после постройки дома – необходимый процесс, позволяющий подтвердить соответствие вашего дома нормативным требованиям. Наши эксперты проведут всестороннюю проверку вашего объекта, включая оценку технического состояния, наличие всех необходимых коммуникаций и соответствие строительным нормам. Мы обеспечим профессиональный анализ следующих аспектов: - Состояние фундамента, стен и крыши, выполненной отделки По завершении экспертизы вы получите официальное заключение о состоянии строительных конструкций. Это обеспечит комфортные условия для жизни и отдыха. Свяжитесь с нами для получения более подробной информации и консультации. Позвольте нам помочь вам сделать ваш дом безопасным и уютным для проживания!",
  },
  {
    title:
      "Предлагаем вам услугу определения качества выполненных ремонтных работ по отделке. Приемка квартиры",
    image: "services/houseQuality.png",
    description:
      "Это важный этап, который гарантирует надежность и эстетичность вашего жилья после завершения ремонта. Определение качества выполненных ремонтных работ жизненно необходимо для того, чтобы удостовериться в соответствии выполненных работ заявленным стандартам и ожиданиям. Наши квалифицированные эксперты тщательно проанализируют все аспекты отделки, выявляя возможные недостатки и нарушения. Мы проведем комплексную оценку следующими параметрам: - Качество материалов, использованных в отделке - Соответствие отделочных работ проектной документации документации, актам выполненных работ и сметных расчетов - Точность выполнения отделочных работ (ровно стен, полов, уровень промерзания стен, состояние инженерных коммуникаций, оконных конструкций и т.д.) - Долговечность и эстетичность выполненных отделочных работ По итогам проверки вы получите акт, в котором будут указаны все выявленные недостатки и дефекты, а также рекомендации по их устранению. Это позволит вам не только сэкономить деньги на возможных переделках, но и уверенно пользоваться своим жильем. Не рискуйте качеством своего ремонта! Свяжитесь с нами для получения консультации и определения качества выполненных работ. Мы поможем сделать ваш дом идеальным!",
  },
];

const Services = () => {
  const navigate = useNavigate();

  const handleServiceClick = (service) => {
    navigate("/services", { state: { service: service } });
    window.scrollTo(0, 0);
  };

  return (
    <div id="services">
      <div className="jobsTitle">Услуги</div>
      <div className="jobs">
        <div className="jobsContainer">
          {services.map((service, index) => (
            <div
              key={index}
              onClick={() => handleServiceClick(service)}
              style={{ cursor: "pointer" }}
            >
              <ServiceBox
                title={service.title}
                image={service.image}
                isLongTitle={service.title.length > 100}
              />
            </div>
          ))}
        </div>
      </div>
    </div>
  );
};

export default Services;
