import { Link } from "react-router-dom";

const Tech = () => {
  return (
        <div className="service">
          <div className="serviceTitle">
            Техническое <br /> обследование
          </div>
          <div className="serviceText">
            Обследование технического состояния зданий и сооружений – один из
            видов инженерных изысканий, неотъемлемая часть обеспечения их
            механической безопасности, а также основа для разработки проектной
            документации. Обследование, в зависимости от цели и полноты может
            быть:
            <ul type="circle">
              <li>
                комплексное или выборочное, для проектирования реконструкции или
                капитального ремонта; для определения возможности дальнейшей
                безаварийной эксплуатации или необходимости восстановления и
                усиления конструкций зданий и сооружений;{" "}
              </li>
              <li>
                для определения возможности дальнейшей безаварийной эксплуатации
                или необходимости восстановления и усиления конструкций зданий и
                сооружений;
              </li>
              <li>
                в виде мониторинга для выявления объектов, у которых изменилось
                напряженно-деформированное состояние с целью дальнейшего
                обследования технического состояния, а также в виде мониторинга
                технического состояния зданий и сооружений, состояние которых
                ограниченно работоспособное или аварийное состоянии - для
                проведения мероприятий по устранению аварийного состояния.
              </li>
              <li>
                комплексное или выборочное, для проектирования реконструкции или
                капитального ремонта; для определения возможности дальнейшей
                безаварийной эксплуатации или необходимости восстановления и
                усиления конструкций зданий и сооружений;{" "}
              </li>
            </ul>
            Право на проведение обследования технического состояния зданий и
            сооружений дает членство в саморегулируемой организации по
            инженерным изысканиям.
          </div>
        </div>
  );
};

export default Tech;
